hello_world/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    Left
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          525;
        startFace       228225;
    }
    Right
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          525;
        startFace       228750;
    }
    frontAndBack
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          4500;
        startFace       229275;
    }
    hot
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          5250;
        startFace       233775;
    }
    cold
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          5250;
        startFace       239025;
    }
)

// ************************************************************************* //
