hello_world/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0   0  0)
    (5   0  0)
    (5   5   0)
    (0  5  0)
    (0  0  2)
    (5  0  2)
    (5  5   2)
    (0  5   2)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (35 150 15) simpleGrading (1 1 1)
);

boundary
(
    
    Left 
    {	
	type wall;
	faces
	(
	 (0 1 5 4)
	);

    }

    Right
    {
	type wall;
	faces
        (

	 (2 3 7 6)
	);
    }

    frontAndBack
    {
        type wall;
        faces
        (
            (6 5 1 2)
	    (4 7 3 0)
        );
    }

    hot
    {
        type wall;
        faces
        (
         (3 2 1 0)
         
        );
    }

    cold
    {
        type wall;
        faces
        (
         (4 5 6 7)  
        );
    }
);

// ************************************************************************* //
